text = """




股价的形成总是建立在预期收益增长率的基础上。
露华浓化妆品公司（Revlon）的创始人查尔斯・朗佛迅（Charles Revson）曾说：“女人买的从不是香水，她们买的是希望。”投资者的心理又何尝不是这样。
市场之所以存在一大批廉价的低市盈率股票，是因为它们的收入和成长预期无法让大多数投资者动心。作为低市盈率投资者，你必须要能够分辨得出哪些股票的的确确大势已去，而哪些股票只是被市场暂时误解和忽视。它们之间一开始并不好区分，所以，投资者必须为此煞费苦心地研究每个低市盈率股票代表的不同含义。
高市盈率的股票是很脆弱的，高增长率预期万一失之毫厘，市场对公司的看法就会谬以千里。
德高望重的蓝筹成长股在重要性等级上处于最底层——而不是和大多数典型基金公司一样处于最高层。这是很自然的结果，因为这些股票家喻户晓，已经被过度挖掘了。
不管市场节节高升、狂跌不止还是默默无闻，我们始终坚持一种经久耐用的投资风格。我们的选股方法包括以下主要要素：
➣低市盈率；
➣基本增长率超过7%；
➣收益有保障；
➣总回报率相对于支付的市盈率两者关系绝佳；
➣除非从低市盈率得到补偿，否则不买周期性股票；
➣成长行业中的稳健公司；
➣基本面好。
成功的投资不需要人气旺盛的股票与绝对多头市场。正确判断和坚持信念是成功的先决条件。推理判断帮助我们选出潜力股，坚忍的毅力则让你不像其他人一样迷失方向。
对我们来说，丑陋的股票往往是漂亮的。如果温莎基金的投资组合看起来就很容易让人认同，那么可以说我们在敷衍了事。
一只股票一旦出现增长率变慢的暗示或征兆，那么在市场的作用下它们的市盈率将直线下降。
从到温莎的第一天起，我就下定决心，一旦见到有望获得高回报率的投资目标就建立特大仓位。
温莎基金购买的股票通常已被市场严重摒弃。它们的市盈率一般低于市场40%～60%。在20世纪90年代气势如虹的牛市中，拥有这么高折价率的股票很难找到。
我们投资的候选对象必须要有稳定的历史记录。除了奔波在山峰和峡谷之间的周期性公司外，其他的公司应当每季度收益有所增长。
投资者希望成长股每年收入都能稳步增长，周期股则与此不同，投资者需要一定的技巧并能够在最好的时机进入——也就是在前一个经济周期让股价滑落了深谷，又正好在大家都意识到公司收入开始回升之前。
关于周期股有一个关键点必须要强调：天花板市盈率很难继续推高。
采用低市盈率策略购买周期公司一般在公司报道收入增长的6～9个月之后获利最大。要很好地预测这个最高点，需要投资者理解相关行业的内在运行机制并能够结合宏观经济走势。
为了衡量投资的每一个美元是否值得，我们把总回报率除以市盈率，由此得到一个简洁明了的参考标准。但是我们不知道起一个怎样的名字好，最后只能定为总报酬率（total return ratio）。
我们打算另辟蹊径，那些总回报率除以市盈率得到的数值超过市场平均值两倍的股票就是我们的首选。










"""

# 在每一行前面加上 "#### "
result = "\n".join("#### " + line for line in text.splitlines())

print(result)
