text = """
不要把爱情与激情、强烈的性欲或顺从与支配混淆了。
大部分被动攻击型男性永远无法准确说出自己的真实意图。他和你一样不清楚自己为何会做出那样的行为。
缺乏自尊是所有被动攻击型男性的共性。
被动攻击型男性忍受着内心捉摸不定的巨大恐惧，这种心理机制注定要让你和他都受到牵绊。
被动攻击型男性总会试图阻挠你。在任何关系中，有权力的人都不会轻易放弃自己的权力。
当被动攻击型男性拒绝满足你的想法或需要（关注、感情、帮助、借款），这是他心中敌意的扭曲表现。
被动攻击型男性对愿意被男性控制的女性有真正的控制权。受害者型的女性自我价值感低，自我形象不健全，因此很容易沦为被动攻击型男性的施虐对象。无论她是相信，以她的档次有一个三心二意的男人够好了，还是有一个总比没有强，受害者一旦与被动攻击型男人建立了关系，改善关系的可能性就很小了。他会开心地让她继续怀疑她的个人价值、性能力、社交能力或任何想法。
如果你在感情上对他十分依恋，他就会把自己的弱点和感情当作武器来对付你。
他们都让我觉得自己配不上他们。他们说爱我的时候，我都不信……我总觉得自己被愚弄了。但我想如果我能赢得他们的爱，我就会变得很特别。但我从来没有感觉到他们真正爱过我。
如果你认为，只有当别人决定爱你时才会给你爱，而不是在你需要的时候或你渴求的时候就给你爱，那么你会在等待中煎熬。
每个人都想让别人满足自己的需求，他让你失望，你就有权生气。
卡罗尔·塔夫里斯在《愤怒：被误解的情绪》一书中写道：“言语攻击通常都会失败，因为它会激怒别人，迫使其做出反击。但是，描述你的心理状态就不算是攻击了，反倒能激发别人去改正自己的行为。”如果你鼓励坦诚交流，也就是说，先表示你生气的原因，你就会为自己赢得转机。
能无拘无束地向对方表达愤怒，证明两人的关系十分稳固，而不是十分脆弱。不承认或不允许愤怒的情侣关系一般较为脆弱敏感，关系双方的自我意识较强，这说明两个人都没有信心经营彼此的关系。
被动攻击型男性并不认为妥协是一种双赢，对他来说，在“斗争”中，只会有一方得胜（要么他赢，要么他输）。
一般来说，如果一个人感到很满足，他也会乐意慷慨地满足别人的需要。一个在爱心满满、关怀备至的家庭长大的孩子会认为，爱不是什么稀缺资源，爱别人并不会让这种资源枯竭。爱就是一口永不干涸的井。
相比之下，被动攻击型男性长大后可能会认为，他从未得到他想要的，现在仍得不到他想要的，所以他就不愿慷慨付出自己的感情。
一个女性被一个男性激起性欲，但这个男性又不能满足她，这对女性来说是无比沮丧的事情。
一般来说，性生活不和谐十有八九说明两人的关系出了问题，例如沟通交流问题，愤怒、依赖和亲密性方面的处理问题，以及性行为焦虑。
在需要合作和互相包容的工作上，被动攻击型男性会选择在暗地蓄意破坏你的工作，他甚至会牺牲自己的工作效率也要把你拉下水。在这种情况下成为他的搭档几乎是不可能的事。
尽管被动攻击行为在工作中很常见，但人们对它的容忍度远低于家里和社会关系中的被动攻击行为。一旦被动攻击者违反了相关规定，公司领导不会像妻子或朋友那样宽恕他。
如果你们的关系出现了问题，而且你也看不到任何改善的可能，那么最好的做法就是终止这种关系。
"""

# 在每一行前面加上 "#### "
result = "\n".join("#### " + line for line in text.splitlines())

print(result)
