text = """
这本书很容易就能被简化成三个词：自动化、自动化、自动化。事实上，在任何市场环境下，只要被动地遵循一套完整的投资规则，许多较为棘手的情绪因素就可以完全消除。
释迦牟尼准确地预见了关于大脑的一个真理：人们对金钱的欲望永不满足。
人们产生这种沮丧幻象的其中一部分原因在于，期待收益是一件让人相当满足的事，然而与其相比，真正获得收益则远没有那么令人兴奋。想象中的奖励没有上限，也不会带来任何现实层面后续的烦恼（如税收、受宠的孩子等等），所以人们很喜欢幻想空中楼阁，并讨论今后将如何处理彩票奖金。
正如贾森·茨威格在谈到这一概念时所说：“当你把钱装进口袋的时候，贪婪的刺激已经消失在类似于神经刺激的哈欠之下了——尽管你已得到了你想要的收益。好吧，赚钱的感觉很好；可是期待赚钱的感觉更好啊！”
大脑似乎只是直观地重视金钱，在追求更多金钱的过程中永远不会满足。
“够了”似乎是一个可变的目标，有缺陷的人类神经是不会让我们完全放弃的。我们生存所需要的钱恰好比我们现在拥有的多一点点。
我们这个时代最痛苦的事情之一是，那些心中充满肯定的人是愚昧的，那些拥有想象力和理解力的人心中充满疑惑和踟蹰。 ——伯特兰·罗素
《幽灵的秘密》（The Mystery of Phanaticism）中写道： 一点点知识会使人自高自大、目中无人。但是，如果一个人掌握了更多的知识，那么他将摆正姿态，会让自己产生低微和谦卑的想法。
价值投资从心理层面来讲是非常困难的。
说到巴菲特，在他1992年的伯克希尔·哈撒韦公司董事长信中可以找到一句不那么精辟但颇为中肯的话：“按折现现金流计算显示的最便宜的投资才是投资者应该购买的……此外，尽管价值等式通常显示股票比债券便宜，但下面的结果也不是必然的：当债券被认为是更具吸引力的投资时，就应该买入。”
投资的困难在很大程度上却源于这样一个事实：你看到的与你得到的恰恰相反。过去三到五年表现良好的股票，在未来几年往往表现不佳。
价值投资不仅仅是反直觉的，它实际上会给我们带来身体上的痛苦。艾森贝格尔和利伯曼通过让受试者玩电脑游戏来验证这样一个假设——社交孤立会导致真正的痛苦。
与直觉相反，结果是一个非常糟糕的预测器，它难以预测战略健全与否。一个打破了三年的纪录（对大多数机构投资者来说是最低的门槛）的市场，仍然有12.5%的概率获得全部运气。如要将运气和技能区分开来，需要将近25年的投资经历，这意味着，只有在一位投资经理即将退休的时候，你才能通过投资结果来判断他是否优秀。
长板资产管理公司的《资本主义分布》（The Capitalism Distribution）描绘了这样一幅画面： • 39%的股票无利可图。 • 18.5%的股票遭受了至少75%的灾难性损失。 • 64%的股票表现比罗素3 000指数逊色。 • 25%的股票几乎囊括了整体业绩。
当你研究、购买或跟踪一只股票时，你对证券的熟悉程度和所有权意味着你将其感知价值提升至实际价值之上。
在决定市场形势时，你早期的投资经历和近期的投资经历可能比它们应该表现的更为突出，并决定了你对市场的主观感受。
研究中男性的交易量比女性高出45%，更让人难以相信的是，单身男性交易量比单身女性高67%。
这项研究中的男性比女性在投资收益表现中每年低了1.4个百分点。
人的大脑在牛市中变得更爱冒险，在熊市中更加保守，这意味着人们从神经学的角度上更倾向于违反“低买高卖”的投资首要规则。
身体和大脑被创造出来是为了高效地完成很多事情，投资却不在其中。
如果你对一个投资想法充满了热情，那么可能是因为你还没有好好地了解它。
我们通过不断做出选择和诋毁未选道路来合成自己的幸福感（却无法从失败中吸取教训）。
我们往往会把对结果的渴望与结果发生的可能性混为一谈。
在一项关于泡沫本质的开创性研究（“法玛泡沫”）中，格林伍德、施莱费尔和游杨分享了一些有趣的发现。其中最引人注目的是，实际上只有一小部分泡沫破裂了。研究人员识别出了从1928年到现在的40个泡沫（以两年或更短时间内有100%的增长来界定），但注意到只有一半多的泡沫破裂（以两年或更短时间内有40%的损失来界定）。
正如瑞索尔兹财富管理公司的迈克尔·巴尼克在他的研究总结中所写的那样：“如果一个行业的股票上涨了50%，那么在未来两年内其崩盘的可能性只有20%。若是100%的收益率将崩溃的概率增加到53%，150%的收益率会将崩溃的概率增加到80%。”
亚瑟·叔本华在评论性欲对决策的影响时说：“我们不应该对那些永远不会成为朋友的人之间的婚姻感到惊讶……爱……将自身投射在那些除了性之外会让我们憎恨、鄙视甚至厌恶的人身上……在做爱之后会立即听到魔鬼的笑声。”
没有了性欲，我们便开始在一个更理性的层面上评估自己的决定，可能会后悔前一天晚上做出的那个选择，或者质疑我们对于伴侣的选择。
"""

# 在每一行前面加上 "#### "
result = "\n".join("#### " + line for line in text.splitlines())

print(result)
