text = """
永远都不能忽略的事实：公司发行股票不是为了让投资者挣钱，你之所以能买到股票是因为有人想卖掉它。
我们必须正视这一点，所有投资都需要一点运气的成分。
查理·芒格说过： 从长期来看，投资股票的收益率很难显著超过对应公司的盈利水平。如果一家公司持续40年资本回报率为6%，你持有了40年，那么你的平均投资收益率与6%不会差别太大，即使你最初是以较大折扣买入的。相反，如果一家企业在20年或30年内每年获得18%的资本回报率，即使你花高价买入，你也会最终取得不错的结果。
你所持有的股票不会遭受负面的盈利信息的冲击概率很低。事实上，单只股票在连续四个季度都没有遭受过盈利低于预期10%以上的负面信息冲击的概率只有1/4。
实现100倍的投资回报意味着你不应该太过关心美联储将要采取的行动。
相对于公司长期的利润增长潜力而言较低的买入价格很重要；
根据我作为基金管理者的经验，企业家才能应该体现为一定规模的股权份额……如果管理层和董事会在公司中没有足够大的利益——至少10%到20%的股权，那么放弃这家公司去看看其他公司吧。 ——马丁·索斯洛夫（Martin Sosnoff）
乔尔·舒尔曼（Joel Shulman）和埃里克·诺伊斯（Erik Noyes）研究了由世界上亿万富翁管理的公司的股价表现。他们发现这些公司的表现比指数高出700个基点（即每年7%）。
伯克希尔的资本结构中杠杆率平均为37.5%。公司的杠杆主要来自保险销售。
最强劲的股价上涨往往发生在盈利持续上升以及市盈率同时提高的时间段内；
市盈率的提升往往伴随着公司盈利的加速增长；
高毛利率是影响长期业绩最重要的单一因素，毛利率水平让公司‘钉住’某一业绩水平，规模和业绩历史同样也是重要的影响指标。
他们强烈意识到差异化的品牌才会是赢家，后面的研究表明，包装是怪兽能量成功的重要原因。
泛图集团（TransDigm， TDG）为飞机制造高度专业化的零件，这些部件很难被取代，对飞行的飞机至关重要，而且没有替代品。
汽车地带（AutoZone， AZO）有一个庞大的激励计划，所有激励指标——资本回报率、每股收益、股东总回报——与股东利益完全一致。因此，毫不奇怪，公司的CEO热衷于回购。
事实上，金矿开采也是一个由于糟糕的资本收益而臭名昭著的行业。
很显然，投资银行的内在动力是销售金融产品，例如股票、债券等。他们并不关心你的利益。
不要把投资银行或者经纪公司的调查报告作为你投资方向的建议。
"""

# 在每一行前面加上 "#### "
result = "\n".join("#### " + line for line in text.splitlines())

print(result)
