text = """
我将回报率定义为“已动用资本回报率”或ROCE。
已动用资本回报率通常计算为现金营业利润除以股东权益和长期负债的总和。
我们很少关注市盈率，通常只是利用它来做一些比较，因为其他市场评论员使用这一指标。在评估我们的投资时，我们更愿意使用自由现金流收益率，因为并非所有的盈利都是平等的。我们投资组合中的公司的资本密集度低于整个市场。由于它们的盈利是用更少的资本产生的，它们的资本回报率远高于平均水平，我们认为这是对它们业绩的主要衡量标准。
巴菲特在1979年致股东的信中将资本回报率确定为公司业绩的主要衡量标准。许多每股收益增长是以资本回报为代价的，因此破坏了价值。
在Fundsmith基金，我们不经常查看市盈率（PE）这一传统的价值衡量标准，因为我们更喜欢查看现金流量。
Fundsmith股票基金的基础投资步骤： 1. 投资好公司。 2. 不要支付过高价格。 3. 什么都不做。
说到产生良好的回报，最重要的是公司质量。
在研究的25,967家公司中，仅5家公司就创造了过去90年回报的10%，而4%略多一点的公司就创造了所有回报。
股票指数的回报率超过了美国国债，而其中的大多数股票却没有。
人们经常对我们说：“哦，你试图挑选赢家。”现实情况是，我们不寻求预测谁将获胜，而是押注已经获胜的公司。
可供选择的优质公司的数量是有限的——你持有的股票数量越多，你就越有可能不得不在质量上妥协。
尽管我们寻找财务业绩优异的公司，但这应该是它们运营的结果，而不是它们的主要目标。，我们寻找的是为客户提供卓越产品和（或）服务的公司，这能使它们产生可观的财务回报并防止竞争侵蚀它们。
似乎有一件事情正在发生变化：发达国家中央银行的职责。美联储最近将其月度量化宽松计划翻了一番，达到850亿美元，并表示将至少维持该计划，直到失业率降至6.5%以下。
永远不要购买需要天才或有魅力的首席执行官才能经营的公司的股票。那个人迟早会离开这家公司。
如果你以合理的价格选择了好公司的股票或一只基金，并且你发现它们的价格波动令你感到不安，那么只需停止查看股价即可。
2000年至2010年间，表现最好的美国基金是CGM精选基金（CGM Focus Fund），其年化回报率为18%。这是一个非常引人注目的回报率。同期，该基金的投资者平均每年亏损11%。投资者表现出了一种准确无误的能力，可以在估值高峰时买入该基金，并在估值低谷时卖出。
我对通过收购实现的收入增长持谨慎态度，其中大部分不会创造价值。
于2012年发表的一项研究，使用了2007年至2011年间全球13家最大制药公司提交的药物成功和失败数据。研究发现，临床前试验中97%的药物未获成功，一期临床试验中95%的药物、二期临床试验中88%的药物也没有成功。直到三期临床试验，前景才变得更好——在到目前为止取得成功的药物中，54%的药物获得了批准。
一种药物在临床前阶段取得成功的概率是万分之一（如果你对数学感兴趣，计算方法是(1-0.97)×(1-0.95)×(1-0.88)×(1-0.46)≈0.0001）。试图在药物试验的早期阶段挑选赢家，这种投资生物技术公司的方式显然就像大海捞针一样。
我们不持有医药行业股票的原因之一是该行业根据“基本”收益进行估值。从2010年左右开始，许多大型制药公司开始转为报告所谓的“核心”收益。
达美乐是特许经营商。如果你将高资本回报率视为优质公司的最重要标志，那么几乎没有比通过特许权经营的企业更好的了，因为大部分资本是由加盟商提供的。
牛市范围不会随着时间推移而扩大——而是缩小。当前的牛市始于2009年，当时的股票不加区别地上涨。然后在发达市场中，美国处于领涨地位。然后是美国的科技行业。然后就是“FAANG”（Facebook，Amazon，Apple，Netflix和Google）。

"""

# 在每一行前面加上 "#### "
result = "\n".join("#### " + line for line in text.splitlines())

print(result)
