text = """


在买入任何股票之前，确保你足够喜欢它，哪怕你买入之后股价就腰斩，你也愿意持有它两年。
莫尼什设计了一条规则：如果他买的一只股票下跌了，他在两年之内不允许自己卖掉它。
残酷的事实是，拥有核心技术或创新的、必然能成功的公司非常稀少——哪怕是高盛、 J. P. 摩根之类更有名的投行提供融资的公司当中，这样的优质公司也是凤毛麟角。
我作为投资银行家的时候，见到的大部分公司要么是圈钱，要么是夸大自己的赢利能力。
华尔街的艰难常态。这里总是有用不完的人手，他们的能力都远远超过他们需要完成的工作。内部竞争异常激烈。在你身后还有几十个人在排队，随时准备取代你的位置。
我真的经历了太长时间，才明白这种业务的实质，如果我想要从中取得成功，就必须被迫违背自己的道德指南。
我在这个环境中实现价值的唯一途径，也是这家公司真正需要我做的事情，就是促成交易。
大部分对冲基金的生存时间不会超过18个月，没有足够的资金达成规模，很难熬过这一关。
我做出了一个被证明是非常有益的决定：我开始在自己周围建立一个“大师思维”的投资家群体圈子，这些人会成为终身好友、值得信赖的参谋。
大部分成功是因为他们做对了很多小事。这是沃尔玛这样的公司如此成功的原因。
巴菲特告诉莫尼什的孩子，选择一个正确的人结婚，将是他们一生中最重要的决定。
巴菲特说，在他自己的人生里，如果生在美国以外的其他任何地方，都将是最大的劣势，因为他或许就读不到格雷厄姆的著作《聪明的投资者》了，这本书在当时只有英语版本。
我们自己的财富与邻居之间的差异，会在很大程度上决定我们的幸福与否。
克制力是一种有限的资源，所以我们必须小心谨慎，不要把它用竭。
哪怕只是拒绝巧克力饼干的诱惑，也会减少人们在之后的任务中的意志力。
很明显，我有必要保持心理健康，享受舒适的个人生活，并维持一定程度的平静心情。事实上，如果你投资之外的生活出问题了，陷入了混乱，或者受到了抑制，那么你很难进行良好的投资。
布莱兹·帕斯卡的名言：“人类的所有问题，都源于人们不能安静地坐在一个房间里。”
我加入了很多组织，在那里我可以经常接触到在很多方面比我优秀的人。
伯克希尔的存在为我的证券组合提供了稳定因素——不论是经济上还是情感上。有巴菲特在我的生态系统中，对我的心理很重要。
太频繁地查看股价会耗尽我的克制力。
公司的高级管理人员——特别是首席执行官，往往都是非常高明的推销员。不论他们的业务表现如何，他们总有办法让听众感觉公司的前景一片光明。这种赢得听众——包括董事会成员和股东——赞同的能力，或许是他们爬上公司食物链顶层的最重要天赋。
超出这家公司控制的价值链其他部分，如果发生改变，会对公司产生怎样的影响？例如，它的收益是否危险地依赖于信贷市场，或者某种商品的价格？

"""

# 在每一行前面加上 "#### "
result = "\n".join("#### " + line for line in text.splitlines())

print(result)
